In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
phool=pd.read_csv("UberRequestData.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'UberRequestData.csv'

#matplotlib

In [5]:
phool

,Request id,Pickup point,Driver id,Status,Request timestamp,Drop timestamp
0,619,Airport,1.0,Trip Completed,11/7/2016 11:51,11/7/2016 13:00
1,867,Airport,1.0,Trip Completed,11/7/2016 17:57,11/7/2016 18:47
2,1807,City,1.0,Trip Completed,12/7/2016 9:17,12/7/2016 9:58
3,2532,Airport,1.0,Trip Completed,12/7/2016 21:08,12/7/2016 22:03
4,3112,City,1.0,Trip Completed,13-07-2016 08:33:16,13-07-2016 09:25:47
...,...,...,...,...,...,...
6740,6745,City,NaN,No Cars Available,15-07-2016 23:49:03,NaN
6741,6752,Airport,NaN,No Cars Available,15-07-2016 23:50:05,NaN
6742,6751,City,NaN,No Cars Available,15-07-2016 23:52:06,NaN
6743,6754,City,NaN,No Cars Available,15-07-2016 23:54:39,NaN
6744,6753,Airport,NaN,No Cars Available,15-07-2016 23:55:03,NaN

In [10]:
phool.head()

,Request id,Pickup point,Driver id,Status,Request timestamp,Drop timestamp
0,619,Airport,1.0,Trip Completed,11/7/2016 11:51,11/7/2016 13:00
1,867,Airport,1.0,Trip Completed,11/7/2016 17:57,11/7/2016 18:47
2,1807,City,1.0,Trip Completed,12/7/2016 9:17,12/7/2016 9:58
3,2532,Airport,1.0,Trip Completed,12/7/2016 21:08,12/7/2016 22:03
4,3112,City,1.0,Trip Completed,13-07-2016 08:33:16,13-07-2016 09:25:47

In [8]:
type(phool)

pandas.core.frame.DataFrame

In [9]:
phool.dtypes

Request id             int64
Pickup point          object
Driver id            float64
Status                object
Request timestamp     object
Drop timestamp        object
dtype: object

In [11]:
phool.shape

(6745, 6)

In [5]:
temp=pd.DataFrame({"a":["1","2","3"],"c":["12-06-11","12-11-01","2-02-13"]})

In [18]:
temp.dtypes

a    object
c    object
dtype: object

In [19]:
pd.to_datetime("12-06-11")

Timestamp('2011-12-06 00:00:00')

In [7]:
temp

   a         c
0  1  12-06-11
1  2  12-11-01
2  3   2-02-13

# changes to orginal permanentt pd to datetime,adding a colm
but deleting is not permanent in pandas

In [12]:
temp["c"]=pd.to_datetime(temp["c"])

In [9]:
temp

   a          c
0  1 2011-12-06
1  2 2001-12-11
2  3 2013-02-02

In [10]:
temp.dtypes

a            object
c    datetime64[ns]
dtype: object

In [15]:
temp['New_Column']='add'

In [14]:
temp

   a          c New_Column
0  1 2011-12-06        add
1  2 2001-12-11        add
2  3 2013-02-02        add

In [16]:
temp.loc[:,'grade']='a'

In [17]:
temp

   a          c New_Column grade
0  1 2011-12-06        add     a
1  2 2001-12-11        add     a
2  3 2013-02-02        add     a

In [14]:
temp.loc['c':,'gra']='c'

In [20]:
temp

   a          c New_Column grade  gra
0  1 2011-12-06        add     a  NaN
1  2 2001-12-11        add     a  NaN
2  3 2013-02-02        add     a  NaN

check builtin datetime for datetime module can change format

In [13]:
temp = temp.assign(New='value')

In [22]:
temp

   a          c New_Column grade  gra    New
0  1 2011-12-06        add     a  NaN  value
1  2 2001-12-11        add     a  NaN  value
2  3 2013-02-02        add     a  NaN  value

In [39]:

# true indicates can hold duplicate values for same col

In [24]:
temp

   a          c New_Column New_Column grade  gra    New
0  1 2011-12-06      value        add     a  NaN  value
1  2 2001-12-11      value        add     a  NaN  value
2  3 2013-02-02      value        add     a  NaN  value

In [12]:
temp['grade']=['value1','value2','value 3']

In [36]:
temp

   a          c New_Column New_Column New_Column    grade  gra    New
0  1 2011-12-06     value1     value2    value 3   value1  NaN  value
1  2 2001-12-11     value1     value2    value 3   value2  NaN  value
2  3 2013-02-02     value1     value2    value 3  value 3  NaN  value

In [11]:
 temp['date']=(['21-1-1','2-2-1995','abc'])

In [9]:
temp.dtypes

a        int64
c       object
date    object
dtype: object

In [55]:
pd.to_datetime(['21-1-1','2-2-1995','abc'],errors="coerce")

DatetimeIndex(['2001-01-21', '1995-02-02', 'NaT'], dtype='datetime64[ns]', freq=None)

In [10]:
temp["a"]=pd.to_numeric(temp["a"])

In [16]:
temp.dtypes

a              int64
c             object
date          object
grade         object
New           object
gra           object
New_Column    object
dtype: object

In [18]:
pd.to_datetime(temp["gra"],format='%m/%d/%y %H :%M')

0   NaT
1   NaT
2   NaT
Name: gra, dtype: datetime64[ns]

In [34]:
temp.describe()

         a
count  3.0
mean   2.0
std    1.0
min    1.0
25%    1.5
50%    2.0
75%    2.5
max    3.0

In [24]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   a           3 non-null      int64
 1   c           3 non-null      object
 2   date        3 non-null      object
 3   grade       3 non-null      object
 4   New         3 non-null      object
 5   gra         0 non-null      object
 6   New_Column  3 non-null      object
dtypes: int64(1), object(6)
memory usage: 296.0+ bytes

In [31]:
phool.head(3)

,Request id,Pickup point,Driver id,Status,Request timestamp,Drop timestamp
0,619,Airport,1.0,Trip Completed,11/7/2016 11:51,11/7/2016 13:00
1,867,Airport,1.0,Trip Completed,11/7/2016 17:57,11/7/2016 18:47
2,1807,City,1.0,Trip Completed,12/7/2016 9:17,12/7/2016 9:58

In [35]:
phool["Pickup point"].value_counts()

City       3507
Airport    3238
Name: Pickup point, dtype: int64

In [38]:
phool["Pickup point"].value_counts().head()# top 5 locations where people visited

City       3507
Airport    3238
Name: Pickup point, dtype: int64

common data manipulation

selecting
iloc ōld version excessing using no
or
loc using  name acessing col

In [40]:
phool.iloc[0:5,0:4] #0 :5 no of rows and second is col0:4

   Request id Pickup point  Driver id          Status
0         619      Airport        1.0  Trip Completed
1         867      Airport        1.0  Trip Completed
2        1807         City        1.0  Trip Completed
3        2532      Airport        1.0  Trip Completed
4        3112         City        1.0  Trip Completed

In [56]:
phool

,Request id,Pickup point,Driver id,Status,Request timestamp,Drop timestamp
0,619,Airport,1.0,Trip Completed,11/7/2016 11:51,11/7/2016 13:00
1,867,Airport,1.0,Trip Completed,11/7/2016 17:57,11/7/2016 18:47
2,1807,City,1.0,Trip Completed,12/7/2016 9:17,12/7/2016 9:58
3,2532,Airport,1.0,Trip Completed,12/7/2016 21:08,12/7/2016 22:03
4,3112,City,1.0,Trip Completed,13-07-2016 08:33:16,13-07-2016 09:25:47
...,...,...,...,...,...,...
6740,6745,City,NaN,No Cars Available,15-07-2016 23:49:03,NaN
6741,6752,Airport,NaN,No Cars Available,15-07-2016 23:50:05,NaN
6742,6751,City,NaN,No Cars Available,15-07-2016 23:52:06,NaN
6743,6754,City,NaN,No Cars Available,15-07-2016 23:54:39,NaN
6744,6753,Airport,NaN,No Cars Available,15-07-2016 23:55:03,NaN

In [49]:
phool.iloc[0:5,[0,3]]# 0 and 3 col access

           Status
0  Trip Completed
1  Trip Completed
2  Trip Completed
3  Trip Completed
4  Trip Completed

In [50]:
phool.iloc[:,[0,4]]

      Request id    Request timestamp
0            619      11/7/2016 11:51
1            867      11/7/2016 17:57
2           1807       12/7/2016 9:17
3           2532      12/7/2016 21:08
4           3112  13-07-2016 08:33:16
...          ...                  ...
6740        6745  15-07-2016 23:49:03
6741        6752  15-07-2016 23:50:05
6742        6751  15-07-2016 23:52:06
6743        6754  15-07-2016 23:54:39
6744        6753  15-07-2016 23:55:03

[6745 rows x 2 columns]

In [57]:
# selecting except last columns
x=phool.iloc[:,:-1]
print(phool.shape)
x.shape

(6745, 6)

(6745, 5)

In [3]:
y=phool.iloc[:-2,:]
y.shape

(6743, 6)

In [75]:
phool.loc[:,["Status","Request id"]]
c=phool.loc[:,"Status"]
type(c)# to convert into dataframe addlistphool.loc[:,["Status","Request id"]] otherwiese series as datatype

pandas.core.series.Series

In [70]:
phool[["Status"]]

                 Status
0        Trip Completed
1        Trip Completed
2        Trip Completed
3        Trip Completed
4        Trip Completed
...                 ...
6740  No Cars Available
6741  No Cars Available
6742  No Cars Available
6743  No Cars Available
6744  No Cars Available

[6745 rows x 1 columns]

In [13]:
# extract first rows and col use loc or iloc head is like limit in sql
x=phool.loc[:,["Status","Request id"]].head()
x

           Status  Request id
0  Trip Completed         619
1  Trip Completed         867
2  Trip Completed        1807
3  Trip Completed        2532
4  Trip Completed        3112

In [14]:
x=phool.loc[0:5,["Status","Request id"]]
x

           Status  Request id
0  Trip Completed         619
1  Trip Completed         867
2  Trip Completed        1807
3  Trip Completed        2532
4  Trip Completed        3112
5  Trip Completed        3879

In [15]:
phool.columns

Index(['Request id', 'Pickup point', 'Driver id', 'Status',
       'Request timestamp', 'Drop timestamp'],
      dtype='object')

In [16]:
# filtering
phool.head()

,Request id,Pickup point,Driver id,Status,Request timestamp,Drop timestamp
0,619,Airport,1.0,Trip Completed,11/7/2016 11:51,11/7/2016 13:00
1,867,Airport,1.0,Trip Completed,11/7/2016 17:57,11/7/2016 18:47
2,1807,City,1.0,Trip Completed,12/7/2016 9:17,12/7/2016 9:58
3,2532,Airport,1.0,Trip Completed,12/7/2016 21:08,12/7/2016 22:03
4,3112,City,1.0,Trip Completed,13-07-2016 08:33:16,13-07-2016 09:25:47

In [26]:
p=phool.loc[phool['Request id']>700,['Request id','Status']]
p

      Request id             Status
1            867     Trip Completed
2           1807     Trip Completed
3           2532     Trip Completed
4           3112     Trip Completed
5           3879     Trip Completed
...          ...                ...
6740        6745  No Cars Available
6741        6752  No Cars Available
6742        6751  No Cars Available
6743        6754  No Cars Available
6744        6753  No Cars Available

[6045 rows x 2 columns]

In [29]:
p=phool[phool['Request id']>10]
p

,Request id,Pickup point,Driver id,Status,Request timestamp,Drop timestamp
0,619,Airport,1.0,Trip Completed,11/7/2016 11:51,11/7/2016 13:00
1,867,Airport,1.0,Trip Completed,11/7/2016 17:57,11/7/2016 18:47
2,1807,City,1.0,Trip Completed,12/7/2016 9:17,12/7/2016 9:58
3,2532,Airport,1.0,Trip Completed,12/7/2016 21:08,12/7/2016 22:03
4,3112,City,1.0,Trip Completed,13-07-2016 08:33:16,13-07-2016 09:25:47
...,...,...,...,...,...,...
6740,6745,City,NaN,No Cars Available,15-07-2016 23:49:03,NaN
6741,6752,Airport,NaN,No Cars Available,15-07-2016 23:50:05,NaN
6742,6751,City,NaN,No Cars Available,15-07-2016 23:52:06,NaN
6743,6754,City,NaN,No Cars Available,15-07-2016 23:54:39,NaN
6744,6753,Airport,NaN,No Cars Available,15-07-2016 23:55:03,NaN

In [32]:
# find all city or airport available
v=phool.loc[phool['Pickup point']=='City',['Pickup point','Status']]
v.head()

   Pickup point          Status
2          City  Trip Completed
4          City  Trip Completed
8          City  Trip Completed
9          City  Trip Completed
11         City  Trip Completed

In [33]:
phool

,Request id,Pickup point,Driver id,Status,Request timestamp,Drop timestamp
0,619,Airport,1.0,Trip Completed,11/7/2016 11:51,11/7/2016 13:00
1,867,Airport,1.0,Trip Completed,11/7/2016 17:57,11/7/2016 18:47
2,1807,City,1.0,Trip Completed,12/7/2016 9:17,12/7/2016 9:58
3,2532,Airport,1.0,Trip Completed,12/7/2016 21:08,12/7/2016 22:03
4,3112,City,1.0,Trip Completed,13-07-2016 08:33:16,13-07-2016 09:25:47
...,...,...,...,...,...,...
6740,6745,City,NaN,No Cars Available,15-07-2016 23:49:03,NaN
6741,6752,Airport,NaN,No Cars Available,15-07-2016 23:50:05,NaN
6742,6751,City,NaN,No Cars Available,15-07-2016 23:52:06,NaN
6743,6754,City,NaN,No Cars Available,15-07-2016 23:54:39,NaN
6744,6753,Airport,NaN,No Cars Available,15-07-2016 23:55:03,NaN

In [44]:
#isin either one them in list
s=phool.loc[phool['Pickup point'].isin(['City','Airport']),['Pickup point','Status']]
#s.head()

  Pickup point          Status
0      Airport  Trip Completed
1      Airport  Trip Completed
2         City  Trip Completed
3      Airport  Trip Completed
4         City  Trip Completed
5      Airport  Trip Completed

In [48]:
s1=phool.loc[phool['Pickup point'].isin(['City']),['Status']]
s1.loc[0:5,:]

           Status
2  Trip Completed
4  Trip Completed

In [47]:
s.shape

(6745, 2)

In [41]:
s.iloc[0:5,]

  Pickup point          Status
0      Airport  Trip Completed
1      Airport  Trip Completed
2         City  Trip Completed
3      Airport  Trip Completed
4         City  Trip Completed

  Pickup point          Status
0      Airport  Trip Completed
1      Airport  Trip Completed
2         City  Trip Completed
3      Airport  Trip Completed
4         City  Trip Completed
5      Airport  Trip Completed

In [58]:
s1=phool.loc[phool['Pickup point'].isin(['City'])&(phool['Status']=='Trip Completed'),['Driver id']]

In [59]:
s1

      Driver id
2           1.0
4           1.0
8           1.0
9           2.0
11          2.0
...         ...
2820      299.0
2823      299.0
2824      299.0
2825      299.0
2827      300.0

[1504 rows x 1 columns]